{
  "beginner": [
    "The quick brown fox jumps over the lazy dog.",
    "A good cook could cook as many cookies as a good cook who could cook cookies.",
    "She sells sea shells by the sea shore.",
    "How much wood would a woodchuck chuck if a woodchuck could chuck wood?",
    "Peter Piper picked a peck of pickled peppers.",
    "The cat sat on the mat and looked at the rat.",
    "Jack and Jill went up the hill to fetch a pail of water.",
    "Mary had a little lamb whose fleece was white as snow.",
    "Humpty Dumpty sat on a wall and had a great fall.",
    "Hickory dickory dock, the mouse ran up the clock.",
    "Rain rain go away, come again another day.",
    "Twinkle twinkle little star, how I wonder what you are.",
    "The sun is bright and the sky is blue today.",
    "Birds fly high in the clear blue sky above us.",
    "Water flows down the river to the deep blue sea.",
    "Dogs love to play fetch in the park with their owners.",
    "Cats like to sleep in warm and cozy places.",
    "Fish swim in the ocean and lakes all day long.",
    "Trees grow tall and provide shade on hot days.",
    "Flowers bloom in spring and make gardens beautiful.",
    "Books are full of stories and knowledge to learn.",
    "Music makes people happy and helps them dance.",
    "Friends are important and make life more fun.",
    "Family members care for each other every day.",
    "Food gives us energy to work and play hard.",
    "Sleep helps our bodies rest and grow strong.",
    "Exercise keeps us healthy and makes us feel good.",
    "School is where we learn new things every day.",
    "Home is a safe place where we can relax.",
    "Games are fun to play with friends and family."
  ],
  "intermediate": [
    "Programming is a skill best acquired by practice and example rather than from books.",
    "The secret of getting ahead is getting started and breaking complex tasks into manageable pieces.",
    "Technology is nothing without faith in people and their ability to use tools wisely.",
    "The best way to predict the future is to invent it through careful planning and execution.",
    "Code is like humor - when you have to explain it, something is probably wrong.",
    "First solve the problem, then write the code that implements your solution clearly.",
    "Any fool can write code that a computer can understand, but good programmers write for humans.",
    "The most important property of a program is whether it accomplishes the user's intention.",
    "Simplicity is the ultimate sophistication in both software design and user experience.",
    "There are only two hard things in computer science: cache invalidation and naming things.",
    "The function of good software is to make the complex appear simple and intuitive.",
    "Programs must be written for people to read, and only incidentally for machines to execute.",
    "The best error message is the one that never shows up in the first place.",
    "Code never lies, but comments sometimes do when they become outdated.",
    "If debugging is removing bugs, then programming must be the process of putting them in.",
    "Experience is what you get when you don't get what you wanted from your project.",
    "The computer was born to solve problems that did not exist before its invention.",
    "Software engineering is about making trade-offs between competing requirements and constraints.",
    "Good design is obvious, great design is transparent and feels completely natural.",
    "The best code is no code at all, but when you must code, make it count.",
    "Premature optimization is the root of all evil in programming projects everywhere.",
    "Documentation is a love letter that you write to your future self and teammates.",
    "Testing can prove the presence of bugs but never their complete absence.",
    "The sooner you start coding, the longer the development process will ultimately take.",
    "Every great developer you know got there by solving problems they were unqualified to solve.",
    "Software is a gas that expands to fill the container you put it in.",
    "The best way to get the right answer is to ask the right question first.",
    "Programming is the art of telling another human what one wants the computer to do.",
    "Clean code always looks like it was written by someone who truly cares about their craft.",
    "The most dangerous phrase in any language is: we have always done it this way."
  ],
  "advanced": [
    "In the realm of quantum computing, superposition allows quantum bits to exist in multiple states simultaneously, fundamentally challenging our classical understanding of information processing and computational complexity theory.",
    "Artificial intelligence and machine learning algorithms are revolutionizing industries by enabling computers to learn patterns, make predictions, and automate complex decision-making processes that were previously exclusive to human cognition.",
    "Cryptocurrency and blockchain technology represent a paradigm shift toward decentralized systems that eliminate intermediaries and create trustless, transparent transaction networks with immutable ledgers and consensus mechanisms.",
    "The Internet of Things ecosystem connects billions of devices worldwide, creating unprecedented opportunities for data collection, analysis, and automated responses in smart environments ranging from homes to entire cities.",
    "Cybersecurity frameworks must evolve continuously to address sophisticated threats including advanced persistent threats, zero-day exploits, social engineering attacks, and state-sponsored cyber warfare campaigns.",
    "Cloud computing architectures leverage distributed systems, containerization, microservices, and orchestration platforms to deliver scalable, resilient, and cost-effective solutions for modern applications and workloads.",
    "Data science methodologies combine statistical analysis, machine learning algorithms, domain expertise, and visualization techniques to extract actionable insights from vast datasets across various industries and research domains.",
    "Software engineering principles emphasize maintainable code, test-driven development, continuous integration, agile methodologies, and DevOps practices to deliver high-quality applications efficiently and reliably.",
    "Neuromorphic computing mimics the structure and function of biological neural networks, promising energy-efficient processing capabilities for artificial intelligence applications and cognitive computing systems.",
    "Quantum cryptography utilizes the principles of quantum mechanics to create theoretically unbreakable communication channels through quantum key distribution protocols and entanglement-based security measures.",
    "Edge computing brings computation and data storage closer to the sources of data, reducing latency, bandwidth usage, and dependence on centralized cloud infrastructure for real-time applications and services.",
    "Distributed consensus algorithms solve the fundamental problem of achieving agreement among multiple nodes in a network, even in the presence of failures, network partitions, and potentially malicious actors.",
    "Computer vision systems use deep learning models to interpret and understand visual information from the world, enabling applications like autonomous vehicles, medical imaging, and augmented reality experiences.",
    "Natural language processing combines computational linguistics with machine learning to enable computers to understand, interpret, and generate human language in a meaningful and contextually appropriate manner.",
    "Bioinformatics applies computational methods to biological data, helping researchers understand genetic sequences, protein structures, and complex biological processes through algorithmic analysis and modeling.",
    "Robotics integrates mechanical engineering, electrical systems, and artificial intelligence to create autonomous machines capable of performing tasks in various environments and interacting with the physical world.",
    "Virtual and augmented reality technologies create immersive digital experiences that blend computer-generated content with the real world, transforming entertainment, education, training, and collaborative work environments.",
    "High-performance computing clusters and supercomputers enable researchers to solve complex scientific problems requiring massive computational resources, from climate modeling to particle physics simulations.",
    "Network security protocols protect data transmission across networks using encryption, authentication, and access control mechanisms to ensure confidentiality, integrity, and availability of information systems.",
    "Software architecture patterns provide proven solutions to common design problems, helping developers create maintainable, scalable, and robust applications using established principles and best practices."
  ],
  "expert": [
    "The implementation of homomorphic encryption schemes enables computation on encrypted data without requiring decryption, thereby preserving privacy while maintaining computational functionality across distributed systems, revolutionizing secure cloud computing paradigms and privacy-preserving data analytics workflows.",
    "Consensus algorithms in distributed systems, such as Byzantine Fault Tolerance mechanisms, Proof-of-Stake protocols, and practical Byzantine Fault Tolerance implementations, ensure network integrity and agreement among nodes despite potential malicious actors, network failures, and asynchronous communication challenges.",
    "Advanced compiler optimizations including loop unrolling, vectorization, instruction scheduling, register allocation, and interprocedural analysis significantly enhance performance by leveraging modern processor architectures, parallel execution units, and sophisticated microarchitectural features.",
    "The mathematical foundations of cryptographic protocols rely on computational complexity theory, number theory, algebraic geometry, and elliptic curve mathematics to ensure security against both classical computational attacks and emerging quantum cryptanalysis threats.",
    "Distributed consensus protocols like Raft, Practical Byzantine Fault Tolerance, HotStuff, and FLP impossibility results address the fundamental challenges of achieving agreement in asynchronous networks with potential Byzantine failures, network partitions, and timing uncertainties.",
    "Category theory provides a unifying mathematical framework for understanding computation, type systems, program semantics, and software architecture through the abstract study of morphisms, functors, natural transformations, and categorical constructions in computer science.",
    "Advanced type systems incorporating dependent types, linear types, effect systems, and refinement types enable stronger compile-time guarantees about program correctness, resource usage, memory safety, and computational effects in functional programming languages.",
    "The lambda calculus serves as the theoretical foundation for functional programming languages, providing a minimal yet complete model of computation through function abstraction, application, and reduction rules that capture the essence of algorithmic thinking.",
    "Formal verification techniques using theorem provers, model checkers, abstract interpretation, and specification languages enable mathematical proof of software correctness, ensuring critical systems meet their specifications and safety requirements.",
    "Differential privacy mechanisms add carefully calibrated statistical noise to data queries and analysis results, providing quantifiable privacy guarantees while preserving the utility of statistical analyses and machine learning models.",
    "Advanced data structures like persistent trees, rope data structures, suffix arrays, and locality-sensitive hashing optimize specific computational patterns and access requirements for large-scale data processing and information retrieval systems.",
    "Parallel algorithm design techniques including divide-and-conquer strategies, parallel prefix operations, work-stealing schedulers, and lock-free data structures enable efficient utilization of multi-core processors and distributed computing environments.",
    "Graph neural networks and geometric deep learning extend traditional neural network architectures to handle non-Euclidean data structures, enabling machine learning on graphs, manifolds, and other complex topological spaces.",
    "Advanced database systems implementing multi-version concurrency control, distributed transactions, consensus-based replication, and query optimization techniques ensure data consistency, availability, and performance in large-scale distributed environments.",
    "Compiler construction techniques including lexical analysis, syntax parsing, semantic analysis, intermediate representation optimization, and code generation transform high-level programming languages into efficient machine code through sophisticated translation processes.",
    "Advanced operating system concepts such as microkernels, capability-based security, real-time scheduling algorithms, and virtualization technologies provide the foundational abstractions for modern computing systems and cloud infrastructure.",
    "Machine learning theory encompasses statistical learning theory, computational complexity of learning, generalization bounds, and algorithmic information theory to understand the fundamental limits and capabilities of automated learning systems.",
    "Advanced networking protocols including software-defined networking, network function virtualization, intent-based networking, and programmable data planes enable flexible, scalable, and efficient management of modern network infrastructure.",
    "Quantum error correction codes and fault-tolerant quantum computing schemes address the inherent fragility of quantum states, enabling reliable quantum computation despite decoherence, gate errors, and measurement uncertainties.",
    "Advanced software engineering methodologies incorporating domain-driven design, event sourcing, command query responsibility segregation, and microservices architecture patterns enable the development of complex, maintainable, and scalable software systems."
  ],
  "programming": [
    "function quickSort(arr) { if (arr.length <= 1) return arr; const pivot = arr[Math.floor(arr.length / 2)]; const left = []; const right = []; }",
    "const binarySearch = (arr, target) => { let left = 0, right = arr.length - 1; while (left <= right) { const mid = Math.floor((left + right) / 2); } }",
    "class HashTable { constructor(size = 53) { this.keyMap = new Array(size); } hash(key) { let total = 0; let WEIRD_PRIME = 31; } }",
    "async function fetchData(url) { try { const response = await fetch(url); if (!response.ok) throw new Error('Network response was not ok'); } catch (error) { console.error('Fetch error:', error); } }",
    "const mergeSort = arr => { if (arr.length <= 1) return arr; const mid = Math.floor(arr.length / 2); const left = mergeSort(arr.slice(0, mid)); const right = mergeSort(arr.slice(mid)); }",
    "interface Repository<T> { findById(id: string): Promise<T | null>; save(entity: T): Promise<T>; delete(id: string): Promise<void>; findAll(): Promise<T[]>; }",
    "SELECT u.name, u.email, COUNT(o.id) as order_count, SUM(o.total) as total_spent FROM users u LEFT JOIN orders o ON u.id = o.user_id GROUP BY u.id HAVING COUNT(o.id) > 0;",
    "docker run -d -p 8080:80 -v /host/path:/container/path --name my-app --restart unless-stopped -e NODE_ENV=production nginx:latest",
    "git checkout -b feature/new-functionality && git add . && git commit -m 'Add new feature' && git push origin feature/new-functionality",
    "import React, { useState, useEffect, useCallback } from 'react'; const MyComponent = () => { const [data, setData] = useState(null); const [loading, setLoading] = useState(false); }",
    "def fibonacci(n): return n if n <= 1 else fibonacci(n-1) + fibonacci(n-2) # Recursive approach with exponential time complexity",
    "public class BinaryTree<T extends Comparable<T>> { private Node<T> root; private class Node<T> { T data; Node<T> left, right; Node(T data) { this.data = data; } } }",
    "fn bubble_sort<T: Ord>(arr: &mut [T]) { for i in 0..arr.len() { for j in 0..arr.len() - 1 - i { if arr[j] > arr[j + 1] { arr.swap(j, j + 1); } } } }",
    "package main; import \"fmt\"; func main() { ch := make(chan int, 2); go func() { ch <- 1; ch <- 2; close(ch) }(); for n := range ch { fmt.Println(n) } }",
    "using System; using System.Linq; public class Program { public static void Main() { var numbers = Enumerable.Range(1, 100).Where(x => x % 2 == 0).ToList(); } }",
    "#!/bin/bash; for file in *.txt; do echo \"Processing $file\"; sed 's/old/new/g' \"$file\" > \"${file%.txt}_modified.txt\"; done",
    "CREATE TABLE users (id SERIAL PRIMARY KEY, email VARCHAR(255) UNIQUE NOT NULL, created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP, updated_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP);",
    "import pandas as pd; import numpy as np; df = pd.read_csv('data.csv'); df['new_column'] = df['column1'].apply(lambda x: x * 2 if x > 0 else 0)",
    "const express = require('express'); const app = express(); app.use(express.json()); app.get('/api/users/:id', async (req, res) => { try { const user = await User.findById(req.params.id); res.json(user); } catch (error) { res.status(500).json({ error: error.message }); } });",
    "from sklearn.model_selection import train_test_split; from sklearn.ensemble import RandomForestClassifier; X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)"
  ],
  "numbers": [
    "The year 1969 marked humanity's first steps on the moon during the Apollo 11 mission with Neil Armstrong and Buzz Aldrin.",
    "In 2024, the global population reached approximately 8.1 billion people worldwide, with growth rates varying by region.",
    "The speed of light is exactly 299,792,458 meters per second in a vacuum, making it a fundamental constant.",
    "There are 86,400 seconds in a day, 1,440 minutes in a day, and 525,600 minutes in a year.",
    "The value of pi (Ï€) is approximately 3.14159265358979323846, extending infinitely without repetition.",
    "A standard deck contains 52 cards with 4 suits and 13 ranks each, totaling 2,598,960 possible poker hands.",
    "The temperature -273.15Â°C represents absolute zero on the Celsius scale, equivalent to -459.67Â°F.",
    "Credit card numbers: 4532-1234-5678-9012, expiry: 12/28, CVV: 456, issuer: Visa International.",
    "Phone numbers: +1-555-123-4567 (US), +44-20-7946-0958 (UK), +81-3-1234-5678 (Japan).",
    "IP addresses: 192.168.1.1 (local), 10.0.0.1 (private), 172.16.254.1 (private), 203.0.113.0 (public).",
    "Mathematical constants: e â‰ˆ 2.71828, Ï† (golden ratio) â‰ˆ 1.61803, âˆš2 â‰ˆ 1.41421356237.",
    "Binary: 1010111 = 87 decimal, hexadecimal: 0xFF = 255 decimal, octal: 777 = 511 decimal.",
    "Coordinates: New York (40.7128Â°N, 74.0060Â°W), Tokyo (35.6762Â°N, 139.6503Â°E).",
    "Scientific notation: 6.022 Ã— 10Â²Â³ (Avogadro's number), 9.109 Ã— 10â»Â³Â¹ kg (electron mass).",
    "Time zones: UTC+0 (GMT), UTC-5 (EST), UTC+9 (JST), UTC-8 (PST), UTC+1 (CET).",
    "Measurements: 1 inch = 2.54 cm, 1 mile = 1.609 km, 1 pound = 0.453 kg, 1 gallon = 3.785 liters.",
    "Financial data: $1,234.56, â‚¬987.65, Â¥10,000, Â£543.21, â‚¹50,000, â‚½25,000.",
    "Percentages: 25% = 0.25 = 1/4, 33.33% = 1/3, 66.67% = 2/3, 75% = 3/4.",
    "Fibonacci sequence: 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377.",
    "Prime numbers: 2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61."
  ],
  "punctuation": [
    "\"Hello, world!\" she exclaimed excitedly; however, he replied somewhat sadly, \"Goodbye, cruel world...\"",
    "The comprehensive list includes: apples, oranges, bananas; but specifically excludes: grapes, berries, and melons.",
    "What time is it? It's exactly 3:30 PM. Don't be late! (The important meeting starts promptly at 4:00 PM)",
    "The company's Q1 results showed impressive growth: revenue $1.2M, profit $300K, and year-over-year growth +25%.",
    "She asked curiously, \"Are you coming to the party?\" He answered hesitantly, \"Yes, but I'll probably be late.\"",
    "Important note: please check all items carefully: (1) batteries, (2) charger, (3) cables, (4) documentation.",
    "The weather forecast predicts: sunny/cloudy conditions, temperature 72Â°F, humidity 45%, wind 10-15 mph from the northwest.",
    "Recommended book titles: \"1984\" by Orwell, \"To Kill a Mockingbird\" by Lee, \"The Great Gatsby\" by Fitzgerald.",
    "Email format example: john.doe@company.com, subject: \"Meeting Notes - Project Alpha - 03/15/2024\"",
    "Mathematical expressions: (a + b)Â² = aÂ² + 2ab + bÂ², where a > 0 and b â‰  0; also, âˆš(xÂ²) = |x|.",
    "Dr. Smith, Ph.D., M.D., said, \"The patient's condition is stable; however, we'll monitor closely.\"",
    "Menu items: appetizers ($8-12), entrees ($18-28), desserts ($6-9), beverages ($3-8), wine ($25-60/bottle).",
    "Academic citations: Johnson, M. (2023). \"Title of Article.\" Journal Name, 45(3), 123-145. DOI: 10.1000/xyz123.",
    "Technical specifications: CPU @ 3.2GHz, RAM: 16GB DDR4, Storage: 512GB SSD, GPU: RTX 4060 (8GB VRAM).",
    "Programming syntax: if (x > 0) { return true; } else if (x < 0) { return false; } else { return null; }",
    "Address format: 123 Main St., Apt. #4B, New York, NY 10001, USA (zip code: 10001-1234).",
    "Literary quote: \"To be, or not to be: that is the question.\" - Shakespeare's Hamlet, Act III, Scene I.",
    "Chemical formula: Hâ‚‚SOâ‚„ (sulfuric acid), NaCl (sodium chloride), Câ‚†Hâ‚â‚‚Oâ‚† (glucose), COâ‚‚ (carbon dioxide).",
    "Time formats: 12:34:56 AM/PM, 24:00 (midnight), UTC+00:00, ISO 8601: 2024-03-15T14:30:00Z.",
    "Punctuation marks: period (.), comma (,), semicolon (;), colon (:), question mark (?), exclamation point (!)."
  ],
  "special": [
    "Password examples: P@ssw0rd123!, Tr0ub4dor&3, C0mpl3x#P@ss$w0rd, S3cur3*K3y!2024, MyP@$$w0rd#123",
    "Code snippets: if (condition) { executeFunction(); } else { handleError(); } // This is a comment",
    "File paths: /home/user/documents/file.txt, C:\\Users\\John\\Desktop\\app.exe, ~/Downloads/archive.zip",
    "URLs: https://www.example.com/path?param=value&id=123#section, ftp://files.server.com/folder/",
    "Regular expressions: /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\\.[a-zA-Z]{2,}$/, \\d{3}-\\d{3}-\\d{4}",
    "JSON data: {\"name\": \"John Doe\", \"age\": 30, \"city\": \"New York\", \"hobbies\": [\"reading\", \"coding\"]}",
    "HTML/XML: <div class=\"container\"><p id=\"paragraph\">Hello World!</p></div><!-- This is a comment -->",
    "CSS rules: .container { margin: 0 auto; padding: 20px; background: linear-gradient(45deg, #ff0000, #00ff00); }",
    "Terminal commands: sudo apt-get update && sudo apt-get install -y nodejs npm && node --version",
    "SQL query: SELECT * FROM users WHERE age BETWEEN 18 AND 65 ORDER BY name ASC LIMIT 10 OFFSET 20;",
    "Email addresses: user@domain.com, test.email+filter@example.org, firstname.lastname@company.co.uk",
    "Currency symbols: $1,234.56 (USD), â‚¬987.65 (EUR), Â£543.21 (GBP), Â¥10,000 (JPY), â‚¹50,000 (INR)",
    "Special characters: !@#$%^&*()_+-=[]{}|;':\",./<>? ~ ` \\ / | Â¬ Â¦ Â° Â§ Â± Ã— Ã· âˆž âˆ‘ âˆ âˆ† Î©",
    "Unicode symbols: â˜€ï¸ â­ â¤ï¸ âœ… âŒ âš ï¸ ðŸ”¥ ðŸ’¡ ðŸš€ ðŸŒ ðŸ“± ðŸ’» ðŸ”’ ðŸ—ï¸ âš¡ ðŸŽ¯ ðŸ† ðŸ“Š ðŸ“ˆ ðŸ“‰",
    "Network protocols: HTTP/HTTPS, FTP/SFTP, SSH, TCP/UDP, SMTP/IMAP, DNS, DHCP, VPN, SSL/TLS",
    "Programming operators: ++, --, +=, -=, *=, /=, %=, ==, !=, >=, <=, &&, ||, ?:, >>, <<, &, |, ^, ~",
    "Mathematical symbols: âˆ‘ âˆ âˆ« âˆ‚ âˆ‡ âˆž Â± Ã— Ã· âˆš âˆ› âˆœ â‰ˆ â‰  â‰¤ â‰¥ âˆˆ âˆ‰ âˆª âˆ© âŠ‚ âŠƒ âŠ† âŠ‡ âˆ… â„• â„¤ â„š â„ â„‚",
    "Keyboard shortcuts: Ctrl+C, Ctrl+V, Ctrl+Z, Ctrl+Y, Alt+Tab, Ctrl+Alt+Del, Cmd+Space, Ctrl+Shift+Esc",
    "Version numbers: v1.0.0, 2.3.4-beta, 3.0.0-rc.1, 1.2.3-alpha.4+build.5, semver: MAJOR.MINOR.PATCH",
    "Command line: grep -r \"pattern\" /path/to/search --include=\"*.txt\" | head -n 10 | sort | uniq -c"
  ]
}
